# AlignmentCheckStationLabels Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..AlignmentFailures..::..AlignmentCheckStationLabels Property
BuiltInFailures..::..AlignmentFailures Class See Also
---
A change to an Infrastructure Alignment or its Stationing Units may have affected the associated Alignment Station Labels. Please check the labels to ensure proper placement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId AlignmentCheckStationLabels { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AlignmentCheckStationLabels As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ AlignmentCheckStationLabels {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..AlignmentFailures Class
Autodesk.Revit.DB Namespace